[
  {
    "id": 1,
    "name": "Aaron Rakow, PhD",
    "img": "aaron-rakow.png",
    "bio": "Dr. Aaron Rakow is the Director of Operations and co-founder of the WISE Center at MedStar Georgetown University Hospital (MGUH). Dr. Rakow is also an Associate Professor within the Department of Psychiatry at MGUH. Dr. Rakow’s professional background focuses on improved access to empirically supported mental health treatments within school systems and primary care settings. Dr. Rakow is the former co-founder and Co-Executive Director of InSite Solutions (merged with MedStar Health in 2018). Dr. Rakow has an array of experience within the educational start-up space and behavioral health field. He has previously worked at the National Institute of Mental Health, the National Institute of Child Health and Human Development, Children's National Health System, The Medical University of South Carolina and the University of Vermont. Dr. Rakow is a licensed Child Psychologist in Washington, DC."
  },
  {
    "id": 2,
    "name": "Megan McCormick, PhD",
    "img": "megan-mcc.png",
    "bio": "Dr. McCormick is the Director of Programs of the WISE Center. Her interests include large-scale program development and implementation aimed at improving public health outcomes for youth. She has worked extensively within community-based organizations on improving public health causes and advocating for youth mental health issues within the Washington DC metro area. Her research background has focused on psychological factors that impact health outcomes, such as pain management and medication adherence, as well as the design, implementation, and evaluation of behavioral interventions to improve access to mental healthcare in primary healthcare settings and prevent negative medical outcomes in pediatric chronic illness populations. She is the co-founder and former Co-Executive Director of InSite Solutions and is also a faculty member within the Department of Psychiatry at MedStar Georgetown University Hospital. Dr. McCormick is a licensed Child Psychologist in Washington, DC."
  },
  {
    "id": 3,
    "name": "Matthew Biel, MD, MSc",
    "img": "matthew-biel.png",
    "bio": "Dr. Biel is the chief of child and adolescent psychiatry at MedStar Georgetown University Medical Center and associate professor of clinical psychiatry and pediatrics at Georgetown University School of Medicine. Dr. Biel has clinical interests in child development, trauma and resilience, mood and anxiety disorders, autism spectrum disorders, and psychiatric care of children with medical illnesses. He is involved in research and has published numerous articles and book chapters addressing access to mental health care for underserved populations, trauma and resilience, and family factors in mood and anxiety disorders. He is very active in medical student and psychiatric residency training and is the training director for the child and adolescent psychiatry fellowship at Georgetown. Dr. Biel studied history and Spanish at Amherst College before receiving his MD and MSc in community medicine at Mount Sinai School of Medicine. He completed residency and fellowship training in psychiatry and child and adolescent psychiatry at NYU School of Medicine."
  },
  {
    "id": 4,
    "name": "Jeff Bostic, MD, EdD",
    "img": "jeff-bostic.png",
    "bio": "Dr. Bostic is a child and adolescent psychiatrist and Medical Director for the WISE Center. Dr. Bostic has clinical, research, and teaching interests in school-based mental health and models of mental health consultation to primary care and other professionals who work with children and adolescents. He is the former director of the School Psychiatry Program (www.schoolpsychiatry.org) of the Department of Psychiatry at Massachusetts General Hospital"
  },
  {
    "id": 5,
    "name": "Karimah Ware, PsyD",
    "img": "karimah-ware.png",
    "bio": "Dr. Ware is a Licensed Clinical Psychologist and Director of Clinical Training for the WISE Center. She has a particular interest in working with youth, whom research has indicated, as being at an increased risk for development of mental disorders. Her areas of specialty are school mental health; conducting various psychological assessments; facilitating individual, group, and family therapy; providing supervision; crisis management; and teacher, psychiatric, and parent consultation. Dr. Ware, who holds a Psy.D. from the American School of Professional Psychology, has worked in settings ranging from schools to community mental health centers to psychiatric and traditional hospital settings. She has been afforded the opportunity to serve as an administrator of a public charter school in DC as well as serve on the board of directors of a public charter school in DC. Dr. Ware's school service extends from 2002, having over 15 years of providing support to DC students, teachers, and faculty. In addition, Dr. Ware has facilitated various workshops, to include effective classroom management, trauma informed care, and parenting trainings. She successfully completed advanced training at the Washington School of Psychiatry in its two-year child and adolescent psychodynamic psychotherapy training program."
  },
  {
    "id": 6,
    "name": "Erin Mathis, Ph.D",
    "img": "erin-mathis.png",
    "bio": "Dr. Mathis is an Assistant Professor in the Department of Psychiatry at Georgetown University located in the Center for Child and Human Development and the Assistant Director of Research and Innovation of the Early Childhood Innovation Network (ECIN). ECIN is a citywide effort to improve developmental outcomes for children and families living in underserved communities in Washington, DC. Dr. Mathis's research interests center on child social-emotional development, self-regulation and academic success and the design and evaluation of  both child- and parent-focused prevention programs that are implemented in school and community settings. In particular, Dr. Mathis has focused on school readiness interventions, mindfulness and early childhood mental health consultation. Dr. Mathis received her doctoral degree in Clinical Psychology at the Pennsylvania State University and received training in school-based mental health at the University of Maryland-Baltimore."
  },
  {
    "id": 7,
    "name": "Emily Aron, MD",
    "img": "emily-aron.png",
    "bio": "Dr. Aron is a licensed Child Psychiatrist for InSite Solutions. Dr. Aron completed her Child & Adolescent Psychiatry Fellowship at New York University's Child Study Center and Bellevue Hospital Center at TheNew York University School of Medicine. Throughout her career, Dr. Aron has emphasized her passion for supporting the needs of traditionally underserved populations and has a strong interest in evidence-based interventions and integrated mental health within school systems. In addition to her role at WISE, Dr. Aron is also a faculty member within the Department of Psychiatry at MedStar Georgetown University Hospital. Dr. Aron is a board certified Child Psychiatrist in Washington, DC."
  },
  {
    "id": 8,
    "name": "Katie Pietris, MA, NCSP",
    "img": "katie-pietris.png",
    "bio": "Ms. Pietris is a Nationally Certified School Psychologist (NCSP) and a certified school psychologist in the States of Maryland, Connecticut and South Carolina. Ms. Pietris completed her Masters of Science in School Psychology from Southern Connecticut State University. Ms. Pietris is research reliable in the Autism Diagnostic Observation Schedule-2 (ADOS) and is highly trained in the administration and interpretation of an extensive range of psychoeducational assessment tools. Ms. Pietris has prior experience working for the Medical University of South Carolina, Clinton Public Schools, Longview School for Children, West Suburban Special Recreation Association, and Southern Connecticut State University."
  },
  {
    "id": 9,
    "name": "Denisha Carter, PsyD",
    "img": "denisha-carter.png",
    "bio": "Dr. Carter is a mental health clinician with an extensive background in assessing and treating the impact of traumatic stress on children, adolescents, and families. Much of Dr. Carter’s research to date has focused on the impact of child sexual abuse of family relationships. Dr. Carter was previously the Director of Clinical Operations and also Director of Training for COMPASS Mental Health Consultants and also previously served as Program Coordinator of Odyssey Family Counseling Center. Dr. Carter brings to WISE extensive experience working with children, adolescents and families with a diverse array of complex clinical needs."
  },
  {
    "id": 10,
    "name": "Celene E. Domitrovich, PhD",
    "img": "celene-domitrovich.png",
    "bio": "Dr. Domitrovich is a member of the faculty in the Department of Psychiatry at Georgetown University located in the Center for Child and Human Development and a Senior Scientist at the Collaborative for Academic, Social, and Emotional Learning (CASEL). She maintains professional affiliations with the Prevention Research Center at Penn State University and the Johns Hopkins School of Public Health. Dr. Domitrovich is a prevention scientist who is interested in the development and evaluation of interventions that promote children’s adjustment and reduce the negative effects of exposure to risk. Her area of specialty is social and emotional learning. Dr. Domitrovich is interested in creating systemic intervention approaches that include the necessary supports to ensure the high quality implementation of evidence-based interventions at scale."
  },
  {
    "id": 11,
    "name": "Neal Horen, PhD",
    "img": "neal-horen.png",
    "bio": "Dr. Horen is a clinical psychologist who has focused on community-based work for the last fifteen years.  He is Director of the Early Childhood Division and Co-director of Training and Technical Assistance for the Georgetown University Center for Child and Human.   Dr. Horen is the lead for mental health on the Head Start National Center on Early Childhood Health and Wellness, the lead for Georgetown on the Home Visiting TA Center-HV-ImpACT, the lead for early childhood systems of care for the TA Network, the Director of the Project LAUNCH TA Center,  and the TA Director of the Center of Excellence for Infant and Early Childhood Mental Health Consultation.  Dr. Horen has worked closely with numerous states, tribes, territories and communities in supporting their development of systems of care for young children and their families.  In addition, Dr. Horen continues to spend time working in direct clinical care including development of social skills interventions for young children and is director of the HOYA clinic which offers therapeutic and assessment services for young children and families.  Dr. Horen’s primary interest is in early childhood mental health and he has lectured extensively on infant and early childhood mental health, challenging behaviors in young children, social skills development,  as well as the impact of trauma on child development.   He is the proud father of four children, 18, 17,17 and 2."
  },
  {
    "id": 12,
    "name": "Myriam Paul",
    "img": "myriam-paul.png",
    "bio": "Myriam Paul is the Grants and Contracts Manager for WISE Center and the Division of child and adolescent psychology. Her responsibilities are to coordinate all aspects of the Child Division grants and contracts activities, supervise staff members, and serve as the administrative contact for the Child Division providers. Myriam has a BS in Finance and Accounting and an MS in Project Management, both from Northeastern University. She has over 10 years’ experience in accounting and grants management in hospital and University settings, including Boston Medical Center, MIT, Kaiser Permanente and GUMC."
  },
  {
    "id": 13,
    "name": "Aubrey Harrison",
    "img": "aubrey-harrison.png",
    "bio": "Aubrey Harrison is currently pursuing his Ph.D. in Clinical Psychology at The George Washington University. His research interests include the experience and effects of racism on minority youth, community violence exposure, and the development and implementation of culturally relevant prevention and intervention programs for urban minority youth. Aubrey obtained his Bachelor of Science in Psychology from Loyola University of Chicago and his Master of Arts in Clinical Psychology from George Washington University. A significant portion of his clinical work has been focused on providing therapy to youth and families of color. Prior to joining MedStar Wise, Aubrey worked with Children’s National Medical Center, the Alexandria Department of Community and Human Services, KIPP DC Public Charter Schools, and served as adjunct faculty for Georgetown University."
  },
  {
    "id": 14,
    "name": "Kristine Goins, MD",
    "img": "kristine-goins.png",
    "bio": "Kristine Goins, MD is a board-certified adult, child and adolescent psychiatrist with clinical and teaching interests in community and school-based mental health, as well as, integrative psychiatry. Dr. Goins completed her adult psychiatry residency at Emory University and served as chief fellow during her child and adolescent psychiatry fellowship at Yale Child Study Center. She currently serves on faculty at MedStar Georgetown University Hospital."
  },
  {
    "id": 15,
    "name": "Brenda Terry-Leonard, PhD",
    "img": "brenda-terry-leonard.png",
    "bio": "Brenda Terry-Leonard, Ph.D., is a Psychologist who earned her doctorate from Howard University.  She has extensive experience providing clinical services to children and families across the developmental spectrum.  She has practiced in a range of settings including a public school, a private full day special education placement, out-patient mental health centers, and a residential facility.  She has also served at local universities as an adjunct faculty providing instruction for a child and adolescent mental hygiene course and as a clinical coordinator for practicum and internship students.  As a Clinical Psychologist with the Center for Wellbeing in School Environments (WISE), she provides Early Childhood Mental Health Consultation (ECMHC) at various Apple Tree Early Learning Public Charter Schools.  In addition, she is a collaborator with the Early Childhood Innovation Network (ECIN)."
  },
  {
    "id": 16,
    "name": "Megan Polanin, PhD",
    "img": "megan-polanin.png",
    "bio": "Dr. Polanin is a Licensed Clinical Psychologist at the WISE Center at MedStar Georgetown University Hospital. She has extensive experience working with urban youth in school and community mental health settings. Dr. Polanin is particularly interested in systems-level and preventative approaches to care, promoting cultural acceptance in children, and integrating mindfulness practices in the classroom. She has a strong interest in advocacy work focused on the mental health and well-being of underserved children and families as well as utilizing psychological science to address social justice issues. Dr. Polanin received her doctoral degree in Counseling Psychology at Loyola University Chicago and completed postdoctoral training at the Kennedy Krieger Institute at Johns Hopkins University School of Medicine."
  },
  {
    "id": 17,
    "name": "Michael Brachfeld, PhD",
    "img": "michael-brachfeld.png",
    "bio": "Dr. Brachfeld is a Licensed Psychologist at the WISE Center at MedStar Georgetown University Hospital. He has experience providing clinical services in schools, community mental health centers, university clinics, and hospitals. His clinical interests focus on promoting positive academic and social-emotional outcomes for children and adolescents. Dr. Brachfeld is passionate about providing school-based consultation to promote teacher well-being as well as the utilization of trauma informed practices in schools. Dr. Brachfeld also has extensive experience providing assessment and treatment services to children and adolescents with autism spectrum disorder. Dr. Brachfeld earned his PhD in School Psychology from Tulane University. He completed his Doctoral Internship at the Kennedy Krieger Institute/Johns Hopkins University School of Medicine. Dr. Brachfeld subsequently completed a Postdoctoral Fellowship in Clinical Psychology at the University of Michigan University Center for the Child and Family."
  },
  {
    "id": 19,
    "name": "Jordan Smith",
    "img": "jordan-smith.png",
    "bio": "Jordan Smith is an administrative assistant with the WISE Center. Originally from the District of Columbia, Jordan holds a Medical Assistant Certificate from Prospect College, in Washington, DC; and has a declaration of a Certified Nursing Assistant, from the University of the District of Columbia. Jordan is currently pursuing a bachelor’s degree in psychology at the University of Maryland Global Campus."
  },
  {
    "id": 19,
    "name": "Anna Jesseman LICSW",
    "img": "wise-placeholder.png",
    "bio": " "
  }
]
